print('2.1.	Составить программу! \n'
      'а)вычисления значения функции y = 17x2– 6x + 13 при любом значении x; \n'
      'б)вычисления значения функции y = 3a2 + 5a – 21 при любом значении а.')
x = input('Введите числовое значение "х":' )
y = 17 * float(x) ** 2 - 6 * float(x) + 13
print(y)

a = input('Введите числовое значение "a":' )
y = 3 * float(a) ** 2 + 5 * float(a) - 21
print(y)


